import { useState } from 'react';
import SingleFaq from './SingleFaq';

const faqs = [
    {
        key: "q1",
        question: "Как да избера правилните крачета за мишката си?",
        answer: "За да избереш правилните крачета за мишката си, трябва да вземеш предвид размера и формата на мишката си, както и твоите лични предпочитания. Може да използваш филтрите на нашия сайт, за да намериш крачета за мишки, съвместими с твоята мишка."
    },
    {
        key: "q2",
        question: "Как да избера правилните крачета за мишката си?",
        answer: "За да избереш правилните крачета за мишката си, трябва да вземеш предвид размера и формата на мишката си, както и твоите лични предпочитания. Може да използваш филтрите на нашия сайт, за да намериш крачета за мишки, съвместими с твоята мишка."
    },
    {
        key: "q3",
        question: "Как да избера правилните крачета за мишката си?",
        answer: "За да избереш правилните крачета за мишката си, трябва да вземеш предвид размера и формата на мишката си, както и твоите лични предпочитания. Може да използваш филтрите на нашия сайт, за да намериш крачета за мишки, съвместими с твоята мишка."
    },
    {
        key: "q4",
        question: "Как да избера правилните крачета за мишката си?",
        answer: "За да избереш правилните крачета за мишката си, трябва да вземеш предвид размера и формата на мишката си, както и твоите лични предпочитания. Може да използваш филтрите на нашия сайт, за да намериш крачета за мишки, съвместими с твоята мишка."
    }
]

const ListFaqs = () => {

    const [activeElement, setActiveElement] = useState("q1");

    return (<>
        {
            faqs && faqs.map((faq, index) => {
                return <SingleFaq setActiveElement={setActiveElement} activeElement={activeElement} key={faq.key + index} faqKey={faq.key} answer={faq.answer} question={faq.question} />
            })

        }
    </>)
}

export default ListFaqs